WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/commands/hcom_nx_ex_flash.c
  int filefd = open(path, O_RDONLY);
  if (filefd == -1)
  {
    error("%s@%d-File not found: %s.\n", thisFile, __LINE__, path);
    return -1;
  }

  struct stat fileStatus;
  ret = fstat(filefd, &fileStatus);
  if (ret < 0)
  {
    error("%s@%d-fstat of %s failed errno:%d\n", thisFile, __LINE__, path, errno);
    return -errno;
  }

  off_t fileSize = fileStatus.st_size;
  if (fileSize != size)
  {
    error("File has invalid size. Expected %d, got %d\n", size, fileSize);
    return -1;
  }

  struct mtd_geometry_s geo;
  _mtd->ioctl(_mtd, MTDIOC_GEOMETRY, (unsigned long)((uintptr_t)&geo));

  info("Erasing flash memory\n");

  int offsetInEraseBlocks = offset / geo.erasesize;

  size_t numBlocksToErase = fileSize / geo.erasesize;
  int blockserased = MTD_ERASE(_mtd, offsetInEraseBlocks, numBlocksToErase);
  if (blockserased < 0)
  {
    return -1;
  }
  info("Erase success\n");

  uint8_t buf[geo.blocksize];
  size_t numBlocksToWrite = fileSize / geo.blocksize;
  size_t numBlocksToSkip = offset / geo.blocksize;
  for (int i = 0; i < numBlocksToWrite; i++)
  {
    if (read(filefd, buf, geo.blocksize) < 0)
    {
      error("Error reading from %s\n", path);
      goto cleanup;
    }

    ssize_t writtenBlocks = MTD_BWRITE(_mtd, i + numBlocksToSkip, 1, buf);
    if (writtenBlocks != 1)
    {
      error("Error while writing block %d to flash\n", i);
      goto cleanup;
    }

    // 10%, 20% etc
    int lastPercentSent = 0;
    int percentDone = (i * 100) / numBlocksToWrite;
    if (percentDone / 10 != lastPercentSent)
    {
      lastPercentSent = percentDone / 10;

      info("Flashing %d%% complete\n", percentDone);
    }

#define NUTTX_UPDATE_VERIFY 0
#if NUTTX_UPDATE_VERIFY > 0
    uint8_t verify[geo.blocksize];
    //
    //  Don't we need to add numBlocksToSkip here?
    //
    MTD_BREAD(_mtd, i, 1, verify);

    if (memcmp(buf, verify, geo.blocksize) != 0)
    {
      syslog(LOG_ERR, "Error while verifying block %d.\n", i);
      goto cleanup;
    }
#endif
  }
  info("Flash operation complete\n");
cleanup:
  close(filefd);
  // if(cmdData->logLevel != LOG_NONE)
  //   return -1;
  return OK;
}

// mirroring the individual flags in bootloader/Core/Inc/ota_data.h
typedef struct
{
  uint8_t update;
  uint8_t rollback;
  uint8_t backup_flag;
  uint8_t update_failure_flag;
  uint8_t rollback_failure;
  uint8_t backup_failure;
  uint8_t rollback_on_fail;
  uint8_t reserved[0x1000 - 7]; // min struct size = flash geo.erasesize
} OTAState;

/****************************************************************************
 * Name: hcom_nx_exec_ex_flash_OS_update_flash1
 *
 * Description:
 *   Part 1 update - AUpdate the operating system.
 * 
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *  OK if successful, -1 or -errno if there was a problem.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
int hcom_nx_exec_ex_flash_OS_update_flash1(void)
{
  int ret;
  OTAState state = {0};
  ret = flash_file(UPDATE_OS_DIR HCOM_NX_FS_NUTTX_UPDATE_FILENAME, HCOM_NX_FS_NUTTX_UPDATE_SIZE, HCOM_NX_FS_MONO_RAW_PARTITION_SIZE);
  if (ret)
    return ret;
  //
  //  Save the current OTA state to flash
  //
  state.update = 0x1;
  ret = hcom_nx_exec_ex_flash_write_buffer_to_flash((uint8_t*)&state, sizeof(OTAState), HCOM_NX_FS_MONO_RAW_PARTITION_SIZE + HCOM_NX_FS_NUTTX_UPDATE_SIZE);
  if (ret)
    return ret;
  ret = unlink(UPDATE_OS_DIR HCOM_NX_FS_NUTTX_UPDATE_FILENAME);
  if (ret)
    return ret;
  hcom_nx_common_utils_host_restart_meadow();
  return 0; // restarts; never actually returns
}

/****************************************************************************
 * Name: hcom_nx_exec_ex_flash_OS_update_flash2
 *
 * Description:
 *   Part 2 update - Update the runtime system.
 * 
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *  OK if successful, -1 or -errno if there was a problem.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
int hcom_nx_exec_ex_flash_OS_update_flash2(void)
{
  int ret;
  ret = flash_file(UPDATE_OS_DIR HCOM_NX_FS_MONO_RUNTIME_FILENAME, HCOM_NX_FS_MONO_RAW_PARTITION_SIZE, 0x0);
  if (ret)
    return ret;
  ret = unlink(UPDATE_OS_DIR HCOM_NX_FS_MONO_RUNTIME_FILENAME);
  if (ret)
    return ret;
  hcom_nx_common_utils_host_restart_meadow();
  return 0; // restarts; never actually returns
}

/****************************************************************************
 * Name: hcom_nx_exec_ex_flash_persistent_data_location
 *
 * Description:
 *   Get the location of the OS persistent data in flash memory.  This is one
 *   erase block past the start of the OtA data block.
 * 
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *  Location in flash of the OS persistent data.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
uint32_t hcom_nx_exec_ex_flash_persistent_data_location(void)
{
  uint32_t location = HCOM_NX_FS_MONO_RAW_PARTITION_SIZE + HCOM_NX_FS_NUTTX_UPDATE_SIZE;
  location += hcom_nx_exec_ex_flash_get_erase_block_size();
  return(location);
}

/****************************************************************************
 * Name: hcom_nx_exec_ex_flash_assert_data_location
 *
 * Description:
 *   Get the location of the assertion data from up_assert in flash memory.
 *   this is 2 erase block past the start of the OtA data block.
 * 
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *  Location in flash of the OS persistent data.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
uint32_t hcom_nx_exec_ex_flash_assert_data_location(void)
{
  uint32_t location = HCOM_NX_FS_MONO_RAW_PARTITION_SIZE + HCOM_NX_FS_NUTTX_UPDATE_SIZE;
  location += (2 * hcom_nx_exec_ex_flash_get_erase_block_size());
  return(location);
}

/****************************************************************************
 * Name: hcom_nx_exec_ex_flash_read_persistent_data
 *
 * Description:
 *   Read the OS persistent data from flash and copy it into the block of
 *   memory pointed to by data.
 * 
 * Input Parameters:
 *   data - Block of memory large enough to hold the persistent data.
 *
 * Returned Value:
 *  OK if successful, -1 or -errno if there was a problem.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
int hcom_nx_exec_ex_flash_read_persistent_data(meadow_os_persistent_data_t *data)
{
  static_assert(sizeof(meadow_os_persistent_data_t) <= OS_PERSISTENT_DATA_SIZE);

  if (data == NULL)
  {
    return(-EINVAL);
  }

  uint8_t *buffer = zalloc(OS_PERSISTENT_DATA_SIZE);
  if (buffer == NULL)
  {
    return(-ENOMEM);
  }

  uint32_t location = hcom_nx_exec_ex_flash_persistent_data_location();
  uint32_t pageLocation = location / hcom_nx_exec_ex_flash_get_block_size();
  size_t pagesToRead = OS_PERSISTENT_DATA_SIZE / hcom_nx_exec_ex_flash_get_block_size();
  // hcom_nx_exec_ex_flash_read_absolute_block(pageLocation, buffer);
  
  size_t pagesRead = MTD_BREAD(_mtd, pageLocation, pagesToRead, buffer);
  if (pagesRead != pagesToRead)
  {
    free(buffer);
    return(-EIO);
  }
  memcpy(data, buffer, sizeof(meadow_os_persistent_data_t));

  free(buffer);

  return(OK);
}

/****************************************************************************
 * Name: hcom_nx_exec_ex_flash_write_persistent_data
 *
 * Description:
 *   Write the persistent data to flash.
 * 
 * Input Parameters:
 *   data - pointer to the persistent data to be written to flash.
 *
 * Returned Value:
 *  OK if successful, -1 or -errno if there was a problem.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
int hcom_nx_exec_ex_flash_write_persistent_data(meadow_os_persistent_data_t *data)
{
  static_assert(sizeof(meadow_os_persistent_data_t) <= OS_PERSISTENT_DATA_SIZE);

  if (data == NULL)
  {
    return(-EINVAL);
  }

