WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/commands/hcom_nx_ex_flash.c
  uint8_t *buffer = (uint8_t *) zalloc(OS_PERSISTENT_DATA_SIZE);
  if (buffer == NULL)
  {
    return(-ENOMEM);
  }
  memcpy(buffer, data, sizeof(meadow_os_persistent_data_t));
  uint32_t location = hcom_nx_exec_ex_flash_persistent_data_location();
  int result = hcom_nx_exec_ex_flash_write_buffer_to_flash(buffer, OS_PERSISTENT_DATA_SIZE, location);
  free(buffer);

  return(result);
}

/****************************************************************************
 * Name: hcom_nx_exec_ex_flash_write_assertion_data
 *
 * Description:
 *   Write the assertion data to flash.
 * 
 * Input Parameters:
 *   data - pointer to the assertion data to be written to flash.
 *   length - amount of the data to be written.
 *
 * Returned Value:
 *  OK if successful, -1 or -errno if there was a problem.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
int hcom_nx_exec_ex_flash_write_assertion_data(const char *data, uint32_t length)
{
  int result;

  if (data == NULL)
  {
    result = -EINVAL;
  }
  else
  {
    uint32_t location = hcom_nx_exec_ex_flash_assert_data_location();
    off_t amount_to_write = length > HCOM_NX_MAXIMUM_ASSERTION_DATA_SIZE ? HCOM_NX_MAXIMUM_ASSERTION_DATA_SIZE : length;
    result = hcom_nx_exec_ex_flash_write_buffer_to_flash((uint8_t *) data, amount_to_write, location);
  }

  return(result);
}

/****************************************************************************
 * Name: hcom_nx_exec_ex_flash_read_assertion_data
 *
 * Description:
 *   Read the assertion data from the last call to up_assert from flash.
 * 
 * Input Parameters:
 *   data - Block of memory large enough to hold the assertion data.
 *
 * Returned Value:
 *  OK if successful, -1 or -errno if there was a problem.
 *
 * Assumptions/Limitations:
 *  data must be large enough to hold the assertion data.
 *
 ****************************************************************************/
int hcom_nx_exec_ex_flash_read_assertion_data(const char *data)
{
  int result = OK;

  if (data == NULL)
  {
    result = -EINVAL;
  }
  else
  {
    uint32_t location = hcom_nx_exec_ex_flash_assert_data_location();
    uint32_t pageLocation = location / hcom_nx_exec_ex_flash_get_block_size();
    size_t pagesToRead = HCOM_NX_MAXIMUM_ASSERTION_DATA_SIZE / hcom_nx_exec_ex_flash_get_block_size();
    
    size_t pagesRead = MTD_BREAD(_mtd, pageLocation, pagesToRead, data);
    if (pagesRead != pagesToRead)
    {
      result = -EIO;
    }
  }

  return(result);
}

